In [1]:
import gc

import pandas as pd

In [2]:
df = pd.read_csv("~/data/G1_1e7_1e2_0_0.csv")

In [3]:
df

           id1    id2           id3  id4  id5    id6  v1  v2         v3
0        id016  id016  id0000042202   15   24   5971   5  11  37.211254
1        id039  id045  id0000029558   40   49  39457   5   4  48.951141
2        id047  id023  id0000071286   68   20  74463   2  14  60.469241
3        id043  id057  id0000015141   32   43  63743   1  15   7.692145
4        id054  id040  id0000011083    9   25  16920   2   9  22.863525
...        ...    ...           ...  ...  ...    ...  ..  ..        ...
9999995  id003  id044  id0000019084   86   65  81507   4   8  30.926485
9999996  id096  id068  id0000020362    4   85  95388   3  11  53.268709
9999997  id071  id006  id0000046057   52   57  55223   1  13  90.368393
9999998  id057  id099  id0000060922   47   36  90944   3   8  34.878200
9999999  id091  id062  id0000084502   68   83  97012   4  10  97.998105

[10000000 rows x 9 columns]

In [4]:
df.head(3)

     id1    id2           id3  id4  id5    id6  v1  v2         v3
0  id016  id016  id0000042202   15   24   5971   5  11  37.211254
1  id039  id045  id0000029558   40   49  39457   5   4  48.951141
2  id047  id023  id0000071286   68   20  74463   2  14  60.469241

In [5]:
del df

## 1e8 CSV

In [4]:
%%time

df_csv_1e8 = pd.read_csv("~/data/G1_1e8_1e2_0_0.csv")
df_csv_1e8.groupby("id1").agg({"v1": "sum"})

CPU times: user 41.2 s, sys: 5.21 s, total: 46.4 s
Wall time: 46.6 s

            v1
id1
id001  2997617
id002  2997194
id003  3001204
id004  3000945
id005  3001731
...        ...
id096  2997704
id097  3004476
id098  2996139
id099  3001163
id100  2998376

[100 rows x 1 columns]

In [22]:
del df_csv_1e8

## 1e8 Parquet

In [23]:
%%time

df_parquet_1e8 = pd.read_parquet("~/data/parquet/G1_1e8_1e2_0_0.parquet")
df_parquet_1e8.groupby("id1").agg({"v1": "sum"})

CPU times: user 22.1 s, sys: 3.78 s, total: 25.9 s
Wall time: 19.8 s

            v1
id1
id001  2997617
id002  2997194
id003  3001204
id004  3000945
id005  3001731
...        ...
id096  2997704
id097  3004476
id098  2996139
id099  3001163
id100  2998376

[100 rows x 1 columns]

In [24]:
del df_parquet_1e8

## 1e8 Parquet + column pruning

In [15]:
%%time

df_parquet_1e8 = pd.read_parquet(
    "~/data/parquet/G1_1e8_1e2_0_0.parquet", columns=["id1", "v1"]
)
df_parquet_1e8.groupby("id1").agg({"v1": "sum"})

CPU times: user 4.07 s, sys: 780 ms, total: 4.85 s
Wall time: 4.5 s

            v1
id1
id001  2997617
id002  2997194
id003  3001204
id004  3000945
id005  3001731
...        ...
id096  2997704
id097  3004476
id098  2996139
id099  3001163
id100  2998376

[100 rows x 1 columns]

In [14]:
del df_parquet_1e8

## Does pandas CSV usecols make queries run faster?

In [8]:
%%time

df_csv_1e8 = pd.read_csv("~/data/G1_1e8_1e2_0_0.csv")
df_csv_1e8.groupby("id1").agg({"v1": "sum"})

CPU times: user 41.2 s, sys: 8.83 s, total: 50 s
Wall time: 52.2 s

            v1
id1
id001  2997617
id002  2997194
id003  3001204
id004  3000945
id005  3001731
...        ...
id096  2997704
id097  3004476
id098  2996139
id099  3001163
id100  2998376

[100 rows x 1 columns]

In [9]:
del df_csv_1e8

In [11]:
%%time

df_csv_1e8_usecols = pd.read_csv("~/data/G1_1e8_1e2_0_0.csv", usecols=["id1", "v1"])
df_csv_1e8_usecols.groupby("id1").agg({"v1": "sum"})

CPU times: user 17.4 s, sys: 1.89 s, total: 19.3 s
Wall time: 19.3 s

            v1
id1
id001  2997617
id002  2997194
id003  3001204
id004  3000945
id005  3001731
...        ...
id096  2997704
id097  3004476
id098  2996139
id099  3001163
id100  2998376

[100 rows x 1 columns]

In [12]:
del df_csv_1e8_usecols

## 1e9 CSV + usecols

In [7]:
%%time

df = pd.read_csv("~/data/G1_1e9_1e2_0_0.csv", usecols=["id1", "v1"])
df.groupby("id1").agg({"v1": "sum"})

CPU times: user 2min 55s, sys: 23.4 s, total: 3min 19s
Wall time: 3min 24s

             v1
id1
id001  30009448
id002  29996534
id003  30003365
id004  30015990
id005  29993888
...         ...
id096  29993372
id097  30015928
id098  29997789
id099  30009485
id100  29987827

[100 rows x 1 columns]

In [8]:
del df

In [9]:
gc.collect()

0

## 1e9 CSV + pyarrow + usecols

In [2]:
%%time

df_csv_1e9_usecols = pd.read_csv(
    "~/data/G1_1e9_1e2_0_0.csv", engine="pyarrow", usecols=["id1", "v1"]
)
df_csv_1e9_usecols.groupby("id1").agg({"v1": "sum"})

CPU times: user 2min 33s, sys: 53 s, total: 3min 27s
Wall time: 2min 19s

             v1
id1
id001  30009448
id002  29996534
id003  30003365
id004  30015990
id005  29993888
...         ...
id096  29993372
id097  30015928
id098  29997789
id099  30009485
id100  29987827

[100 rows x 1 columns]

In [5]:
del df_csv_1e9_usecols

In [6]:
gc.collect()

0